from db.models import MetaData, Version, StdDisc
from commons.utils.datetime import str_to_datetime

def init():
    init_meta_data()
    init_version()
    init_std_disc()

def init_meta_data():
    if MetaData.objects.count() > 0:
        return

    version = '2020.01.01.001'
    MetaData(version, version).save()

def init_version():
    if Version.objects.count() > 0:
        return

    date = str_to_datetime('20200101', '%Y%m%d')
    Version(date, date).save()
    
def init_std_disc():
    if StdDisc.objects.count() > 0:
        return

    # 1.지분공시
    """
    StdDisc(1, '임원ㆍ주요주주특정증권등소유상황보고서').save()
    StdDisc(2, '주식등의대량보유상황보고서').save()
    StdDisc(3, '공개매수신고서').save()

    # 2.주요사항보고
    StdDisc(4, '자기주식취득결정').save()
    StdDisc(5, '자기주식취득신탁계약체결결정').save()
    StdDisc(6, '타법인주식 및 출자증권 취득/처분/양수/양도 결정').save()
    StdDisc(7, '유상/무상증자 결정').save()
    StdDisc(8, '감자결정').save()
    StdDisc(9, '전환사채권 발행결정').save()
    StdDisc(10, '주권관련 사채권 양도/양수 결정').save()
    StdDisc(11, '회사 분할/합병 결정').save()
    StdDisc(12, '유형자산 양수/양도 결정').save()
    StdDisc(13, '영업 양수/양도 결정').save()
    StdDisc(14, '신주인수권부사채권발행결정').save()
    StdDisc(15, '교환사채권발행결정').save()

    # 3.정기공시
    StdDisc(16, '사업보고서').save()
    StdDisc(17, '분기보고서').save()
    StdDisc(18, '반기보고서').save()

    # 4.거래소 공시
    StdDisc(19, '단일판매ㆍ공급계약체결').save()
    StdDisc(20, '최대주주등 소유주식 변동 신고서').save()
    StdDisc(21, '감사보고서 제출').save()
    StdDisc(22, '자산재평가').save()

    StdDisc(23, '조회공시').save()
    StdDisc(24, '최대주주변경').save()
    """

    std_discs = [
         # 1.지분공시
         (000, 1, '전체')
        ,(100, 1, '임원ㆍ주요주주특정증권등소유상황보고서')
        ,(101, 1, '주식등의대량보유상황보고서')
        ,(102, 1, '공개매수', '공개매수 신고서/보고서')

        # 2.주요사항보고
        ,(200, 1, '자기주식', '자기주식 취득/계약/처분')
        ,(202, 1, '타법인주식및출자증권', '타법인주식 및 출자증권 취득/처분/양수/양도 결정')
        ,(203, 2, '상증자', '유상/무상증자 결정')
        ,(204, 1, '감자결정|감자완료', '감자 결정/완료')
        ,(205, 1, '전환사채', '전환사채권 발행 결정')
        ,(206, 1, '상장채권|매출채권|사채권|채권은행','주권관련 사채권 취득/양도/양수 결정')
        ,(207, 1, '배당결정', '현금ㆍ현물배당결정')
        ,(208, 1, '회사분할|회사합병', '회사 분할/합병 결정')
        ,(209, 1, '유형자산', '유형자산 양수/양도 결정')
        ,(210, 1, '영업양수|영업양도|자산양수|자산양도', '자산 양수/양도 결정')
        ,(211, 1, '신주인수권', '신주인수권부사채권발행/ 조정')
        ,(212, 1, '교환사채권발행결정')
        ,(213, 1, '타인에대한채무보증결정')

        # 3.정기공시
        ,(300, 1, '사업보고서')
        ,(301, 1, '분기보고서')
        ,(302, 1, '반기보고서')

        # 4.거래소 공시
        ,(400, 2, '단일판매ㆍ공급계약', '단일판매ㆍ공급계약 체결/해지')
        ,(401, 1, '최대주주등소유주식변동|최대주주등의주식보유변동',  '최대주주등 소유주식 변동')
        ,(402, 1, '감사보고서', '감사보고서 제출')
        ,(403, 1, '자산재평가')

        ,(500, 1, '조회공시')
        ,(501, 1, '최대주주변경')
        ,(502, 1, '특수관계인', '특수관계인과의 거래')
        ,(503, 1, '자본잠식')
        ,(504, 1, '검찰|소송|횡령|배임|벌금', '검찰 기소/고발 혹은 횡령/배임/소송 공시')
        ,(505, 1, '기업인수목적회사', '기업인수목적회사 공시')
        ,(506, 1, '부동산투자회사', '부동산투자회사 공시')
        ,(507, 1, '선박투자회사', '선박투자회사 공시')
        ,(508, 1, '유동성공급계약', '유동성공급계약의 체결/변경/해지')
        ,(509, 1, '주주총회', '주주총회 소집/결과')
        ,(510, 1, '파산|부도', '파산/부도 공시')
        ,(511, 1, '기술도입', '기술도입 공시')
        ,(512, 1, '단기차입금', '단기차입금 증가/감소')
        ,(514, 1, '불성실공시', '불성실공시법인 지정/미지정')
        ,(515, 1, '거래정지', '주권/은행 거래정지')
        ,(516, 1, '회생절차|회생계획', '회생 절차/계획')
        ,(517, 1, '생산중단|생산재개', '생산 중단/재개')
        ,(518, 1, '타법인주식및출자증권', '타법인주식및출자증권 양수/양도')
        ,(519, 1, '지주회사의자회사', '지주회사의 자회사 편입/탈퇴')
        ,(520, 1, '경영사항')
        ,(521, 1, '풍문또는보도에대한해명')
        ,(522, 1, '대표이사변경|대표이사(대표집행임원)변경', '대표이사변경')
        ,(523, 1, '투자설명서')
        ,(524, 1, '증권신고서')
        ,(525, 1, '증권발행실적보고서')
        ,(526, 1, '일괄신고', '일괄신고서')
        ,(527, 1, '합병등종료보고서')
        ,(528, 1, '영업실적|영업(잠정)실적|결산실적|공모실적', '영업실적 및 전망')
        ,(529, 1, '파생상품거래', '파생상품거래 이익/손실')
        ,(530, 1, '자원개발', '자원개발 투자/진행')
        ,(531, 1, '신탁계약', '신탁계약 취득/해지')
        ,(532, 1, '상각형조건부자본증권발행결정')
        ,(533, 1, '지속가능경영보고서등관련사항')
        ,(534, 1, '사외이사의선임', '사외이사의선임ㆍ해임또는중도퇴임에관한신고')

        ,(535, 1, '주식소각', '주식소각결정')
        ,(536, 1, '기업설명회', '기업설명회(IR)개최')
        ,(537, 1, '주식매수선택권', '주식매수선택권 행사')
        ,(538, 1, '상장폐지', '상장폐지 결정')
        ,(539, 1, '계열회사|계열금융회사', '계열회사와의 거래')
        ,(540, 1, '시설투자|시설외투자', '시설/시설외 투자')
        ,(541, 1, '외부감사인선임', '외부감사인 선임/해임')
        ,(542, 1, '해외증권')
        ,(543, 1, '타인에대한담보제공결정')
        ,(544, 1, '의결권대리행사권유', '의결권대리행사권유')
        ,(545, 1, '전환청구권행사')
        ,(546, 1, '매출액또는손익구조')
        ,(547, 1, '본점소재지변경')
        ,(548, 1, '기타시장안내')
        ,(549, 1, '전환가액', '전환가액의조정')
        ,(550, 1, '증권발행결과')
        ,(551, 1, '투자유의안내')
        ,(552, 1, '주식분할결정')
        ,(553, 1, '교환청구권행사')
        ,(554, 1, '주주명부폐쇄')
        ,(555, 1, '지정자문인선임계약','지정자문인 선임계약의 체결/해지')
        ,(556, 1, '소속부변경')
        ,(557, 1, '기타안내사항')
        ,(558, 1, '금전대여|증권대여', '금전/증권대여 결정')
        ,(559, 1, '영업정지', '영업정지')
        ,(560, 1, '주식교환|주식병합', '주식 병합/교환 결정')
        ,(561, 1, '기업지배구조보고서공시')
        ,(562, 1, '거래처와의거래중단')
        ,(563, 1, '수시공시의무관련사항')
        ,(564, 1, '공정거래자율준수프로그램운영현황')
        ,(565, 1, '해산사유발생')
        ,(566, 1, '장래사업ㆍ경영계획')
        ,(567, 1, '교환사채(해외교환사채포함)발행후만기전사채취득')
        ,(568, 1, '경영권변경등에관한계약체결')
        ,(569, 1, '대표집행임원변경')
        ,(570, 1, '소액공모', '소액공모공시')
        ,(571, 1, '상호변경안내')
        ,(572, 1, 'CB발행결정철회')
        ,(573, 1, '중요한자산양수도결정')
        ,(574, 1, '교환가액의조정')
        ,(575, 1, '채무인수결정')
        ,(576, 1, '철회신고서')
        ,(577, 1, '선급금지급결정')
        ,(578, 1, '대규모기업집단현황공시')
        ,(579, 1, '대출원리금연체사실발생')
        ,(580, 1, '재해발생')
        ,(591, 1, '임원의변동')
        ,(592, 1, '감사전재무제표기한내미제출신고서')
        ,(593, 1, '배당락')
        ,(594, 1, '회계처리기준위반에따른임원의해임권고조치')
        ,(595, 1, '이사회의성별구성의무준수현황')
        ,(596, 1, '사채원리금미지급발생')
        ,(597, 1, '경영정상화계획의이행약정체결')
        ,(598, 1, '채무면제결정')
        ,(599, 1, '결산기변경안내')
        ,(600, 1, '특허권취득')
        ,(601, 1, '이전상장결정')
        ,(602, 1, '풋백옵션등계약체결결정')
        ,(603, 1, '가족친화인증ㆍ유효기간연장ㆍ인증취소')
        ,(604, 1, '반기검토의견부적정또는의견거절')
        ,(605, 1, '비유동자산취득결정')
        ,(606, 1, '주요주주변경')
        ,(607, 1, '종류주식의보통주식으로전환결의')
        ,(608, 1, '임상시험단계진입ㆍ종료')
        ,(609, 1, '녹색기업|녹색기술', '녹색/기술 사업에대한인증ㆍ취소')
        ,(610, 1, '어음위ㆍ변조발생')
        ,(611, 1, '제품에대한수거ㆍ파기등결정')
        ,(612, 1, '수증')
        ,(613, 1, '증권예탁증권(DR)발행결정')
        ,(614, 1, '소액공모법인결산서류')
        ,(615, 1, '증여결정')
        ,(615, 1, '온실가스배출권의처분')
    ]

    for std_disc in std_discs:
        if std_disc.__len__() == 4:
            id, category, keyword, report_nm = std_disc
        else:
            id, category, keyword = std_disc
            report_nm = keyword
        StdDisc(id, category, keyword, report_nm).save()





    



    """
    StdDisc.objects.raw({
    '$where': 'function() { \
            return this.report_nm.match(\'' + report_nm + '\' ) \
                }'
                }).first()
    """

    """
    StdDisc.objects.raw({
    '$where': 'function() { \
            return "자기주식취득결정했지롱".match(this.report_nm) \
                }'
    }).first()
    """


    """
    STD_DISC 변경

    1. std_disc 삭제
    2. db.models  STD_DISC 수정
    3. init.py 재생성, 일자변경
    4. Disc에 std_disc 재 할당
    5. ChatRoom

    6. UserWatch(Unit)  => UserWatch(MongoModel)
    watchs 안에 Unit 있다. 거기에 StdDisc 사용함
    7. UserSimula(Unit) => UserSimula(MongoModel)
    simuas 안에 Unit 있다. 거기에 StdDisc 사용함

    8. Disc안에 StdDisc 있다

    email = 'minkyu8306@gmail.com'
    user = User.objects.get({'email':email})
    uw = UserWatch.objects.get({'user':user._id})
    uw.watchs.__len__()

    watchs[0]: ObjectId('607ffbac36b367817e313a35')   id: 7    -> 203
    watchs[1]: ObjectId('6080ce1d0132a0a344e02b06')   id: 19   -> 400
    watchs[2]: ObjectId('6080cdeb0132a0a344e02b05')   id: 11   -> 208

    """
    """                                                     
    from db.models import StdDisc, Disc
    _std_disc = dict()
    discs = Disc.objects.raw({})
    for disc in discs:
        f = 0
        for keyword in keywords:
            for k in keyword.split('|'):
                if disc.report_nm.find(k) >= 0:
                    f = 1
        if f == 0:
            print(disc.report_nm)

    """                                                     

    """
    import sys
    sys.path.append('../../')
    from db.models import Disc
    import requests
    import time
    from task.reportparser import report_2
    discs = Disc.objects.raw({'rcept_dt':{'$gte':'20170101','$lte':'20171231'}}).order_by([('rcept_dt',1)])
    f = 0
    for disc in discs:
        if disc.report_nm.find('상증자결정') < 0:
            continue
        if disc.report_nm.find('무') < 0:
            continue
        if disc.report_nm.find('첨부정정') >= 0:
            continue
        f = f + 1
        print(disc.report_nm, disc.url)
        html = requests.get(disc.url).text
        disc.content = report_2(html)
        if not disc.content:
            disc.content = disc.report_nm
        disc.save()
        print(disc.content)
        time.sleep(20)
    """

